/*----------------------------------------------------------------
 *
 * •••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••
 *
 *   文件名称：A-Boring-Apartments.cpp
 *   创建日期：2020年10月20日 ---- 22时46分
 *   结束日期：2020年10月20日 ---- 23时11分
 *   题    目：codeforce
 *   算    法：<++>
 *   描    述：<++>
 *
 * •••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••
 *
----------------------------------------------------------------*/

#include <cstdio>
int main()
{
    int n;
    scanf("%d", &n);
    while (n--) {
        int num;
        int rotate = 0;
        scanf("%d", &num);
        int bits = num % 10;
        int sum = 0;
        while (num != 0) {
            rotate++;
            num /= 10;
            sum += rotate;
        }
        printf("%d\n", (bits - 1) * 10 + sum);
    }
    return 0;
}
