/*----------------------------------------------------------------
 *   
 *   文件名称：01.cpp
 *   创建日期：2021年05月20日 星期四 20时52分26秒
 *   题    目：AcWing 96 奇怪的汉诺塔
 *   算    法：递归
 *   描    述：<++>
 *
 ----------------------------------------------------------------*/

#include <cstdio>
#include <cstring>
#include <algorithm>
using namespace std;

int main() {
    int f3[15];  //在三根棍子可用的情况下，将i个盘子移到另一根棍子上需要的次数
    int f4[15];  //在四根棍子可用的情况下，将i个盘子移到另一根棍子上需要的次数
    /*预先算出3根棍子所需要的次数*/
    f3[1] = 1;
    for (int i = 2; i <= 12; ++i)
        f3[i] = 1 + 2 * f3[i-1];

    memset(f4, 0x3f, sizeof f4);
    f4[0] = 0; //0个盘子不需要任何操作
    for (int i = 1; i <= 12; ++i)
        for (int j = 0; j < i; ++j)
            /* 把这i个盘子的上面j个移到辅助棍1上
             * 然后把剩余的i-j个盘子移动到目标盘上
             * (由于这i-j个盘子一定比前j个盘子大，所以一定不能移动到辅助棍上
             * 所以就相当于这i-j个盘子只能在三根棍子可用的情况下移动到另一根棍子上)
             * 再把之前的j个盘子移动到目标盘上
             */
            f4[i] = min(f4[i], 2 * f4[j] + f3[i - j]);
    for (int i = 1; i <= 12; ++i)
        printf("%d\n", f4[i]);
    return 0;
}
