/*----------------------------------------------------------------
 *   
 * •••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••
 *
 *   文件名称：01.cpp
 *   创建日期：2021年05月31日 星期一 21时48分18秒
 *   结束日期：2021年05月31日 星期一 21时48分20秒
 *   题    目：<++>
 *   算    法：<++>
 *   描    述：<++>
 *
 ----------------------------------------------------------------*/

#include <cstdio>
#define lowbit(x) ((x) & -(x))
#define NEXTLINE puts("");
const int maxn = 1e5 + 5;
int n;
int I[maxn];

int main() {
    scanf("%d", &n);
    for (int i = 0; i < n; ++i)
        scanf("%d", &I[i]);
    for (int i = 0; i < n; ++i) {
        int cnt = 0;
        while (I[i]) {
            I[i] ^= lowbit(I[i]);
            ++cnt;
        }
        printf("%d ", cnt);
    }
    NEXTLINE; 
    return 0;
}
