/*----------------------------------------------------------------
 *
 * •••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••
 *
 *   文件名称：B-Jumps.cpp
 *   创建日期：2020年11月30日 ---- 23时20分
 *   题    目：codeforce
 *   算    法：<++>
 *   描    述：1. 如果直接到达，没话说，返回step
 *             2. 如果超过x的时候比x大一，由于不选择走i的话只能-1，所以更改之前的步数也到大不了x
 *                所以就不能更改之前的步数，而是最后再走一步
 *             3. 更改之前的某一步一定能使step时到达x
 *
 * •••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••
 *
----------------------------------------------------------------*/

#include <cstdio>
int main()
{
    freopen("in.txt", "r", stdin);
    freopen("out.txt", "w", stdout);
    int t;
    scanf("%d", &t);
    while (t--) {
        int x;
        scanf("%d", &x);
        int step  = 1;
        int cul = 0;
        int i = 1;
        while (cul < x) {
            cul += i;
            if (cul == x)
                break;
            else if (cul == x + 1)  {
                ++step;
                break;
            }
            else if (cul > x)
                break;
            ++step;
            ++i;
        }
        printf("%d\n", step);
    }
    return 0;
}
