/*----------------------------------------------------------------
 *   
 * •••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••
 *
 *   文件名称：01.cpp
 *   创建日期：2021年05月31日 星期一 21时37分24秒
 *   结束日期：2021年05月31日 星期一 21时37分27秒
 *   题    目：<++>
 *   算    法：<++>
 *   描    述：<++>
 *
 ----------------------------------------------------------------*/

#include <cstdio>
const int maxn = 1e5 + 5;
int n, m, x;
int A[maxn], B[maxn];

int main() {
    scanf("%d %d %d", &n, &m, &x);
    for (int i = 0; i < n; ++i)
        scanf("%d", &A[i]);
    for (int i = 0; i < m; ++i)
        scanf("%d", &B[i]);
    int i = 0, j = m - 1;
    while (A[i] + B[j] != x) {
        if (A[i] + B[j] < x)
            ++i;
        else
            --j;
    }
    printf("%d %d\n", i, j);
    return 0;
}
