/*----------------------------------------------------------------
 *   
 *   文件名称：02.cpp
 *   创建日期：2021年07月31日 星期六 17时35分40秒
 *   题    目：AcWing 0131 直方图中最大矩形
 *   算    法：单调栈
 *   描    述：AcWing 视频代码
 *       麻烦了，麻烦了，看luogu SP1805的代码
 *
 ----------------------------------------------------------------*/

#include <cstdio>
const int maxn = 1e5 + 5;
int h[maxn];

int main() {
    while (scanf("%d", &n), n) {
        for (int i = 1; i <= n; ++i) {
            scanf("%d", &a[i]);
            a[0] = -1;   // 地一个位置放-1高度的矩形，方便处理边界
        }
    }
    return 0;
}
