/*----------------------------------------------------------------
 *
 *   文件名称：1026.cpp
 *   创建日期：2020年11月07日 ---- 16时49分
 *   题    目：<++>
 *   算    法：<++>
 *   描    述：<++>
 *
----------------------------------------------------------------*/

#include <cstdio>
int main()
{
    int t1;
    int t2;
    scanf("%d", &t1);
    scanf("%d", &t2);
    int sum_t = (t2 - t1) / 100;
    if ((t2 - t1) % 100 >= 50)
        ++sum_t;
    int seco = sum_t % 60;
    sum_t /= 60;
    int minu = sum_t % 60;
    sum_t /= 60;
    int hour = sum_t;
    printf("%02d:%02d:%02d\n", hour, minu, seco);
    return 0;
}
