/*----------------------------------------------------------------

 * •••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••
 *
 *   文件名称：1023 组个最小数.cpp
 *   创建日期：2020年08月25日 ---- 21时08分
 *   结束日期：2020年08月26日 ---- 10时08分
 *   题    目：组个最小数
 *   算    法：贪心
 *   描    述：题目中给了至少1个非零的数字，如果没给呢
 *
 * •••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••
 *
----------------------------------------------------------------*/

#include <cstdio>

int main() {
    int num[10];
    for (int i = 0; i < 10; i++)
        scanf("%d", &num[i]);

    for (int i = 1; i < 10; i++)
        if (num[i] != 0) {
            printf("%d", i);
            num[i]--;
            break;
        }

    for (int i = 0; i < 10; i++)
        while (num[i]--)
            printf("%d", i);

    printf("\n");
    return 0;
}
